<center><img src='https://raw.githubusercontent.com/Jangrae/img/master/title.png' width=500/></center>

<center><img src='https://raw.githubusercontent.com/Jangrae/img/master/practice.png' width=300/></center>

# 실습 목표

- CSV 파일에서 데이터를 일어올 수 있습니다.
- 다양한 속성와 메소드를 사용해서 데이터프레임 정보를 확인할 수 있습니다.
- 데이터를 정렬할 수 있습니다.

# P1. [실습] 데이터프레임 살펴보기

## [실습1] CSV 파일 불러오기, 데이터 살펴보기 - 1

In [1]:
# 라이브러리 불러오기
import pandas as pd
import numpy as np

1) **read_csv()** 함수를 사용해 'Graduate_apply.csv' 파일을 읽어 데이터프레임 **graduate**를 만드세요.

- 파일 경로: 'https://raw.githubusercontent.com/Jangrae/csv/master/Graduate_apply.csv'
- 대소문자를 구분하니 주의하세요.

In [23]:
# 파일 읽어오기
file_path = 'https://raw.githubusercontent.com/Jangrae/csv/master/Graduate_apply.csv'
graduate = pd.read_csv(file_path)

graduate.head()

   admit  gre   gpa  rank
0      0  380  3.61     3
1      1  660  3.67     3
2      1  800  4.00     1
3      1  640  3.19     4
4      0  520  2.93     4

2) graduate의 **shape**를 확인하여 행과 열의 개수를 확인하세요.

In [5]:
# shape 확인
graduate.shape

(400, 4)

3) **columns** 속성과 **types** 속성을 사용해 graduate의 열 이름과 각 열의 데이터 형식을 확인하세요.

In [13]:
# 열 이름 확인
print(graduate.columns)
print(graduate.dtypes)

Index(['admit', 'gre', 'gpa', 'rank'], dtype='object')
admit      int64
gre        int64
gpa      float64
rank       int64
dtype: object

In [15]:
# 열 데이터 형식 확인
graduate.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   admit   400 non-null    int64
 1   gre     400 non-null    int64
 2   gpa     400 non-null    float64
 3   rank    400 non-null    int64
dtypes: float64(1), int64(3)
memory usage: 12.6 KB

4) **head()** 메소드와 **tail()** 메소드를 사용해 graduate의 데이터의 **첫 3행**의 데이터와 **마지막 3행**의 데이터를 출력하세요.

In [16]:
# 상위 3행 출력
graduate.head(3)

   admit  gre   gpa  rank
0      0  380  3.61     3
1      1  660  3.67     3
2      1  800  4.00     1

In [17]:
# 마지막 3행 출력
graduate.tail(3)

     admit  gre   gpa  rank
397      0  460  2.63     2
398      0  700  3.65     2
399      0  600  3.89     3

5) **describe()** 메소드를 사용해 graduate의 기초 통계 정보를 확인하세요.

In [18]:
# 기초 통계 정보 확인
graduate.describe()

            admit         gre         gpa       rank
count  400.000000  400.000000  400.000000  400.00000
mean     0.317500  587.700000    3.389900    2.48500
std      0.466087  115.516536    0.380567    0.94446
min      0.000000  220.000000    2.260000    1.00000
25%      0.000000  520.000000    3.130000    2.00000
50%      0.000000  580.000000    3.395000    2.00000
75%      1.000000  660.000000    3.670000    3.00000
max      1.000000  800.000000    4.000000    4.00000

6) **np.array()** 함수를 사용해 graduate의 데이터를 배열로 변환하여 출력하세요.

In [24]:
# 배열로 변환
np.array(graduate)

array([[  0.  , 380.  ,   3.61,   3.  ],
       [  1.  , 660.  ,   3.67,   3.  ],
       [  1.  , 800.  ,   4.  ,   1.  ],
       ...,
       [  0.  , 460.  ,   2.63,   2.  ],
       [  0.  , 700.  ,   3.65,   2.  ],
       [  0.  , 600.  ,   3.89,   3.  ]])

7) **sort_values()** 메소드를 사용해 **gre** 열을 기준으로 **오름차순**으로 정렬하세요.

In [25]:
# gre 열을기준 오름차순 정렬
graduate.sort_values(by='gre')

     admit  gre   gpa  rank
304      0  220  2.83     3
179      0  300  3.01     3
71       0  300  2.92     4
315      1  300  2.84     2
316      1  340  3.00     2
..     ...  ...   ...   ...
33       1  800  4.00     3
25       1  800  3.66     1
369      0  800  3.89     2
286      1  800  3.22     1
293      0  800  3.97     1

[400 rows x 4 columns]

8) **rank** 열을 기준으로 **오름차순**, 같은 rank 열에 대해서는 **gpa** 열을 기준으로 **내림차순** 정렬하세요.

In [27]:
# rank + gpa 열을기준 오름차순, 내림차순 정렬
graduate.sort_values(by=['rank','gpa'], ascending = [True, False])

     admit  gre   gpa  rank
2        1  800  4.00     1
12       1  760  4.00     1
14       1  700  4.00     1
79       1  620  4.00     1
165      0  700  4.00     1
..     ...  ...   ...   ...
22       0  600  2.82     4
59       0  600  2.82     4
184      0  500  2.79     4
48       0  440  2.48     4
289      0  420  2.26     4

[400 rows x 4 columns]

## [실습2] CSV 파일 불러오기, 데이터 살펴보기 - 2

In [28]:
# 라이브러리 불러오기
import pandas as pd
import numpy as np

1) 'titanic_simple.csv' 파일을 불러와 데이터프레임 **titanic**을 만드세요.

- 파일 경로: 'https://raw.githubusercontent.com/Jangrae/csv/master/titanic_simple.csv'

In [30]:
# 파일 읽어오기
file_path = 'https://raw.githubusercontent.com/Jangrae/csv/master/titanic_simple.csv'
titanic = pd.read_csv(file_path)
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,Southhampton
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,Cherbourg
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,Southhampton
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,Southhampton
4,5,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,Southhampton

2) titanic의 shape를 확인하세요.

In [31]:
# shape 확인
titanic.shape

(891, 8)

3) titanic의 열 이름과 각 열의 데이터 형식을 확인하세요.

In [36]:
# 열 이름 확인
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'Fare',
       'Embarked'],
      dtype='object')

In [37]:
# 열 데이터 형식 확인
titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
Fare           float64
Embarked        object
dtype: object

4) 상위 10개 행의 데이터를 조회하세요.

In [38]:
# 상위 10개 확인
titanic.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,Southhampton
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,Cherbourg
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,Southhampton
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,Southhampton
4,5,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,Southhampton
5,6,0,3,"Moran, Mr. James",male,NaN,8.4583,Queenstown
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,51.8625,Southhampton
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,21.0750,Southhampton
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,11.1333,Southhampton
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,30.0708,Cherbourg

5) 기초 통계 정보를 확인하세요.

In [39]:
# 기초 통계 정보 확인
titanic.describe()

       PassengerId    Survived      Pclass         Age        Fare
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118   32.204208
std     257.353842    0.486592    0.836071   14.526497   49.693429
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    7.910400
50%     446.000000    0.000000    3.000000   28.000000   14.454200
75%     668.500000    1.000000    3.000000   38.000000   31.000000
max     891.000000    1.000000    3.000000   80.000000  512.329200

6) 가장 많은 운임(fare)을 내고 탄 사람은 누구인가요?

In [54]:
# Fare 열을 기준으로 내림차순 정렬해서 첫 행을 확인
titanic = titanic.sort_values(by='Fare',ascending=False)
titanic.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,512.3292,Cherbourg

## <center>수고하셨습니다</center>
<center><img src='https://raw.githubusercontent.com/Jangrae/img/master/end.png' width=200/></center>